# GetLS

## Description
_Use GetLSN instead._
Function GetLS returns the line style of the referenced object.

```pascal
FUNCTION GetLS(h : HANDLE): INTEGER;
```

```python
def vs.GetLS(h):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Remarks
*\_c\_* 2016.02.29: This is deprecated and returns always -1 as of VW 2016.

## Examples
#### VectorScript ####
```pascal
lStyleValue := GetLS(handleToObject);
```
#### Python ####
```python
lStyleValue = vs.GetLS(handleToObject)
```

```pascal
resultN := GetLS(h);
```
```python
import vs

# _ Function GetLS returns the line style of the referenced object.
h = vs.FSActLayer()  # handle to the first selected object on the active layer

resultN = vs.GetLS(h)
vs.Message('GetLS returned: ' + str(resultN))
```

## See Also
GetLSN from Vectorworks 2013

## Version
Availability: from All Versions, deprecated from Vectorworks 2013

## Category
* Object Attributes